# Abbreviation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystemType..::..Abbreviation Property
MEPSystemType Class See Also
---
Identifies the abbreviation, the short name, for the system type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Abbreviation { get; set; }
```

Visual Basic
---
```text
Public Property Abbreviation As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Abbreviation {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace